<?php
$msg = array(
//sys 100000以下编号为系统提示
	'100001' 	=>	'操作成功',
	'100002'	=>	'操作失败',
	'100003'	=>	'没有找到页面',
	'100004'	=>	'',
	'100005'	=>	'请发送验证码到您注册的手机',
	'100006'	=>	'验证码错误或者已过期',
	'100007'	=>	'您输入的手机号或者验证码不正确',
	'100008'	=>	'手机号码不对',
	'100009'	=>	'系统异常，请刷新重试',
	'100100'	=>	'系统异常，请返回重试',
	'100010'	=>	'接收的id不合法',
	'100011'	=>	'传递的参数不合法',
	'100012'	=>	'数据不能为空',
	'100013'	=>	'静态页面生成成功，开始进行版本差异化比较',
	'100014'    =>  '已存在此推荐信息，请不要重复推荐，谢谢！',

	'100020'	=>	'用户名或密码错误',
	'100021'	=>	'数据传输异常，请刷新重试',
	'100022'	=>	'请您登录后再进行此操作',
	'100023'	=>	'用户不存在',
	'100024'	=>	'姓名不能为空',
    '100025'    =>  '您的账户还未开通企业权限',
    '100026'    =>  '账户未激活', #状态验证不通过，未激活
    '100031'	=>	'DAO数据校验未通过',



	//用户相关
	'100101'	=>	'用户ID不能为空',
	'100102'	=>	'登录成功',
	'100103'	=>	'请填写昵称',
	'100104'	=>	'昵称太长了',
	'100105'	=>	'昵称太短了',
	'100106'	=>	'昵称已经被占用了',
	'100107'	=>	'昵称格式不对',
	'100108'	=>	'昵称无法使用',		//保留字
	'100109'	=>	'昵称无法使用',		//违禁词
	'100110'	=>	'用户名或密码错误',		//违禁词
	'100111'	=>	'cookie设置失败，请检查浏览器设置后重试',
	'100112'	=>	'系统繁忙，请稍后重试',
    '100113'	=>	'退出成功',


	'100120'	=>	'请填写密码',
	'100121'	=>	'密码长度不对',
	'100122'	=>	'密码格式有误',
	'100123'	=>	'新密码不能为空',
	'100124'	=>	'两次输入的密码不一致',
	'100125'	=>	'该手机号码还未在顺电注册！',


	'100130'	=>	'请填写邮箱',
	'100131'	=>	'邮箱格式有误',
	'100132'	=>	'该邮箱已被注册',
	'100133'	=>	'激活码不能为空',
	'100134'	=>	'激活码错误',
	'100135'	=>	'注册失败，请重新注册',
	'100137'	=>	'手机号码不能为空',
	'100138'	=>	'该手机号码已被注册',
	'100139'	=>	'手机号码格式有误',
	'100140'	=>	'手机号码和会员卡号填写一个',
	'100141'	=>	'',
	'100142'	=>	'请输入正确的手机号或者会员卡号',
	'100143'    =>  '注册成功',

	//connect
	'100201'	=>	'连接网站未配置',
	'100202'	=>	'连接失败，请返回重试',
	'100203'	=>	'异常错误',
	'100204'	=>	'用户名或密码错误',

	//重置密码
	'100301'	=>	'数据异常，请刷新重试',	//用户ID被篡改
	'100302'	=>	'没有找到该用户',
	'100303'	=>	'密码修改失败',
	'100304'	=>	'密码修改成功',
	'100305'	=>	'邮件格式不对',
	'100306'	=>	'用户不存在',
	'100307'	=>	'没有找到该页面',
	'100308'	=>	'两次输入的密码不一致',
	'100309'	=>	'发送短信间隔不能小于60秒',



	//修改密码


	//修改个人信息
	'100171'	=>	'用户资料已保存',
	'100172'	=>	'用户资料保存失败，请重试',


	//添加关注
	'100194'	=>	'该文件不存在',


//110000-210000为后台管理
	//权限管理
	'110100'	=>	'您没有该权限',
	'110101'	=>	'只能添加已注册用户',
	'110102'	=>	'该手机号已被设置权限',
	'110103'	=>	'该用户已被设置权限',
	'110200'	=>	'客户端编号不能为空',
	'110201'	=>	'同一客户端不能重复授权',
	'110202'	=>	'没有找到相应的app',

   //后台基础设置提示消息
	'110300'	=>	'提交数据不能为空，请录入数据后再提交！',
    '110301'	=>	'提交数据不正确，请正确录入数据后再提交！',

	//商品管理
	'105001'	=>	'该商品不存在',
	'105002'	=>	'该条形码对应商品不唯一，请输入货号',
    '105003'	=>	'货号和条形码至少输入一个',
	'105004'	=>	'该条形码对应的商品不存在',
	'105005'	=>	'该货号对应的商品不存在',
	'105006'	=>	'该条码对应的商品不存在',
	'105007'	=>	'开始时间不能早于次日凌晨0点',
	'105008'	=>	'请输入正确的日期格式',
	'105009'	=>	'导入Excel表中条码不能为空',
	'105010'	=>	'导入Excel表中商品名称不能为空',
	'105011'	=>	'导入Excel表中规格不能为空',
	'105012'	=>	'导入Excel表中单位不能为空',
	'105013'	=>	'导入Excel表中采购价不能为空',
	'105014'	=>	'导入Excel表中采购量不能为空',
	'105015'	=>	'导入Excel表中供应商不能为空',
	'105016'	=>	'价格预调整不同时间段必须是连续的',
	'105017'	=>	'输入时间不能早于当前的时间',
	'105018'	=>	'开始时间相同则结束时间也必须相同',
	'105019'	=>	'同一时间段内数量区间必须是连续的',
	'105020'	=>	'最小数量必须大于0',
	'105021'	=>	'请先向总商品库导入新商品',
	'105022'	=>	'商品条码不能为空',
	'105023'	=>	'商品条码必须为数字',
	'105024'	=>	'请输入8位或者12位或者13位的条码',
	'105025'	=>	'商品名称不能为空',
	'105026'	=>	'该商品已下架',
	'105027'	=>	'条码已有所对应的sku',
	'105028'	=>	'组合商品名称不能为空',
	'105029'	=>	'编辑商品状态变为异常时出错',
	'105030'	=>	'该商品下面还有未删除的sku'	,
	'105031'	=>	'请输入正确的组合商品数量',
	'105032'	=>	'子商品库存数量不能满足输入的组合商品数量',
	'105033'	=>	'请输入正确的拆包数量',
	'105034'	=>	'拆包数量大于库存数量',
	'105035'	=>	'删除失败，因分店库存不全为0',
	'105036'	=>	'该商品下已有该sku',
	'105037'	=>	'该商品已被删除，不能继续编辑',
	'105038'	=>	'sku属性不能为空',
	'105039'	=>	'sku全称不能为空',
	'105040'	=>	'该名称的商品已经存在'	,
	'105041'	=>	'该商品已处于异常状态，不能继续编辑',
	'105042'	=>	'在本店没有找到该商品，或总商品库中没有该商品',
	'105043'	=>	'该配送点暂无此商品，我们会尽快补货..',
	'105044'	=>	'至少包含一个sku',
	'105045'	=>	'价格只能在一个未来时间生效',
	'105046'	=>	'商品价格必须是大于0的数字',
	'105047'	=>	'请为价格设置生效时间',
	'105048'	=>	'该时间已设置了价格',
	'105049'	=>	'该分类下还有子分类，请先移除子分类',
    '105050'	=>	'商品ID不能为空',
    '105051'	=>	'开始时间不能大于结束时间',
    '105052'    =>  '品牌名称已存在',
    '105053'    =>  '评价内容不能为空',







	//关联商品
	'105201'	=>	'关联商品不能添加自己',

	'120001' 	=>	'条形码格式不正确',
	'120002' 	=>	'导入excel第一行不能为空',

	//顾客管理
	'106001'	=>	'该用户不存在',
	'106002'	=>	'该用户ID不能为空',
	'106003'	=>	'请输入正确的电话号码',
	'106004'	=>	'请输入正确的客户姓名',
	'106005'	=>	'客户id参数传递错误',
	'106006'	=>	'客户电话参数传递错误',
	'106007'	=>	'客户地址参数传递错误',
	'106008'	=>	'该电话号已经被使用',
	'106009'	=>	'请填写实付现金',
	'106010'	=>	'请填写充值金额',
	'106011'	=>	'会员卡账号或密码错误，请重试..',
	'106012'	=>	'该手机号已注册成为VIP会员',

	//订单管理
	'107001' 	=>	'没有找到该订单',
	'107002' 	=>	'该订单不属于您，不能操作，请核实',
	'107003' 	=>	'只有未支付的订单才能关闭',
	'107004' 	=>	'只有已发货的订单才能确认收货',
	'107005' 	=>	'请填写收货人',
	'107006' 	=>	'请选择收货城市',
	'107007' 	=>	'请填写详细地址',
	'107008' 	=>	'请填写邮编',
	'107009' 	=>	'手机/电话至少填写一个',
	'107010' 	=>	'优惠金额有误',
	'107011' 	=>	'订单运费有误',
	'107012' 	=>	'请填写发票抬头',
	'107013' 	=>	'请填写公司名称',
	'107014' 	=>	'请填写纳税人识别号',
	'107015' 	=>	'请填写注册地址',
	'107016' 	=>	'请填写注册电话',
	'107017' 	=>	'请填写开户银行',
	'107018' 	=>	'请填写银行账户',
	'107019' 	=>	'支付总额大于应付金额',
	'107020'	=>  '数量有误',
	'107021'	=>  '数量不能超过未分配数量',
	'107022'	=>  '发货单商品数量不能全部为0',
	'107023'	=>  '库存不足，请检查',
	'107024'	=>  '优惠金额不能大于未分配优惠金额',
	'107025'	=>  '优惠金额未分配完',
	'107026'	=>  '快递费用不能大于未分配快递费用',
	'107027'	=>  '快递费用未分配完',
	'107028'	=>  '快递费用未分配完',
	'107029'	=>  '退款金额不能大于可退金额',
	'107030'	=>  '退款金额不能为空',
	'107031'	=>  '收款账号不能为空',
	'107032'	=>  '手续费不能为空',
	'107033'	=>  '退款流水号不能为空',
	'107034'	=>  '支付账户不能为空',
	'107035'	=>  '退款金额不能大于发货单可退金额',
	'107036'	=>  '退款金额不能小于或等于0',

	//触屏管理
	'108001'	=>  '地区名称不能为空',
	'108002'	=>  '文件名不能为空',
	'108003'	=>  '问题不能为空',
	'108004'	=>  '关联分类不能为空',
	'108005'	=>  '问题不能多于5个',
	'108006'	=>  '答案不能为空',
	'108007'	=>  '搜索条件不能为空',
	'108008'	=>  '提示不能为空',
	'108009'	=>  '链接地址格式不正确',
	'108010'	=>  'token错误',
	'108011'	=>  '未进行系统设置',
	'108012'	=>  '设备描述不能为空',
	'108013'	=>  '所属门店不能为空',
	'108014'	=>  '摆放区域不能为空',
	'108015'	=>  '广告组名称不能为空',
	'108016'	=>  '分类ID不能为空',

	//订单管理
	'201001'	=>	'该订单已付款，不能关闭',
	'201002'	=>	'没有找到订单',
	'201003'	=>	'只有已付款，并通过物流配送的订单才能发货',
	'201004'	=>	'该订单不能自提',
	'201005'	=>	'该订单不支持此操作',
	'201006'	=>	'输入的验证信息不正确',
	'201007'	=>	'订单详情确认送达数据错误',
	'201008'	=>	'该订单状态异常，不能完成发货',
	'201009'	=>	'该订单状态异常，不能完成送达',
	'201010'	=>	'订单不能为空！',
	'201011'	=>	'退货单的退货数量错误！',
	'201012'	=>	'购买数量大于库存数量',
	'201013'	=>	'该地址没有指定供货点，您可以重新选择您的位置',
	'201014'	=>	'您无权操作此订单',
	'201015'	=>	'订单金额预期和实际不一致！',
	'201016'	=>	'提交的金额不能小于0',
	'201017'	=>	'会员卡支付的金额不能大于订单金额',
	'201018'	=>	'会员卡支付的金额不能大于账户余额',
	'201019'	=>	'使用会员卡支付或存零钱必须填写正确的会员卡号！',
	'201019'	=>	'不能同时使用会员卡支付    且往会员卡中存入零钱!',

	//分类管理
	'203000' 	=>	'分类名称不能为空',

	//店铺管理
	'204000'	=>	'没有找到该店铺',
	'204001'	=>	'店铺名称不能为空',
	'204002'	=>	'店铺负责人不能为空',
	'204003'	=>	'授权号不存在',
	'204004'	=>	'授权号或者授权密匙错误',
	'204005'	=>	'请选择店铺！',
	'204006'	=>	'请选择店铺类型',
	'204007'	=>	'店铺地址不能为空',
	'204008'	=>	'店铺负责人联系方式不能为空',
	'204009'	=>	'管理员手机号码错误',
	'204010'	=>	'该店铺已被删除',

	//商品管理
	'205001'	=>	'添加成功',
	'205002'	=>	'添加失败',
    '205003'	=>	'更改锁定库存失败',
    '205004'	=>	'删除供应商品错误',
	'205005'	=>	'本商品已在本次盘点中盘点完毕',
	'205006'	=>	'本商品分组已存在',

    '205007'	=>	'目录参数非法',
    '205008'	=>	'文件读取失败',
    '205009'	=>	'文件读取失败',
    '205010'	=>	'文件目录已存在',

	//配送地点管理
	'206001'	=>	'配送楼宇不能为空',
	'206002'	=>	'配送小区不能为空',
	'206003'	=>	'该小区不在配送范围之内',
	'206004'	=>	'请填写完整送货地址',

	//库存管理
	'207001'	=>	'调出数量大于库存数量,请重新输入调出数量',
	'207002'	=>	'调入数量大于调出数量，请重新输入调入数量',
	'207003'	=>	'该调拨已经出库，不能重复操作',
	'207004'	=>	'该调拨已经入库，不能重复操作',
	'207005'	=>	'请输入格式正确的调拨数量',
	'207006'	=>	'请输入正确的调拨数量',
	'207007'	=>	'数量必须大于0',
	'207008'	=>	'请选择调入仓库',
	'207009'	=>	'该批调拨单没有任何商品',

	//采购管理
	'208001'	=>	'请选择采购分店',
	'208002'	=>	'采购数量不能为0',
	'208003' 	=>	'导入excel第一行不能为空',
	'208004' 	=>	'请填写正确的计划采购时间',
	'208005'	=>	'请输入正确的条码或货号',
	'208006'	=>	'采购数量必须为正整数',
	'208007'	=>	'请填写正确的实际支付金额',
	'208008'	=>	'请为每一款商品选择供应商',
	'208009'	=>	'请填写供应商名称',
	'208010'	=>	'该供应商名称已存在',


	//同步信息
	'209001' 	=>	'同步数据为空',

	//退货管理
	'210001'	=>	'退货数量大于已购买数量',
	'210002'	=>	'请输入正确的退货数量',
	'210003'	=>	'总退货数量不能大于总采购数量',
	'210004'	=>	'该采购单未入库，不能进行退货操作',
	//会员卡管理
	'220001'	=>	'会员卡号不存在或已被其他人绑定..！',
	'220002'	=>	'该会员卡已被别人使用..！',
	'220003'	=>	'该卡不在使用期..！',
	'220004'	=>	'某张会员卡没有绑定亲情组！',
	'220005'	=>	'该两组亲情组已合并！',
	'220006'	=>	'该会员卡余额不足',
	'220007'	=>	'该会员卡积分不足',
	'220008'	=>	'批次生成会员卡失败，回滚成功',
	'220009'	=>	'该批次下会员卡数量为0',
	'220010'	=>	'请输入正确的充值金额',
	'220011'	=>	'该手机号码绑定的用户已经为会员',
	'220012'	=>	'请输入正确的会员卡数量',
	'220013'	=>	'一次性生成会员卡数量不得超过10000张',
	'220014'	=>	'会员卡密码必须为数字',
	'220015'	=>	'请输入正确的实付现金',
	'220016'	=>	'请输入正确的会员卡号',

	//帮助中心
	'230001'	=>	'文章标签已经存在',
	'230002'	=>	'文章标题不能为空',
	'230003'	=>	'文章内容不能为空',
	'230004'	=>	'请选择文章分类',
	'230005'	=>	'文章标签不能为空',
	'230006'	=>	'分类名称不能为空',
	'230007'	=>	'标签不能为数字',
    '230008'	=>	'文章不存在',
    '230009'	=>	'文章静态化失败',

	//CMS
	'240001'    =>  '碎片不存在',
	'240002'    =>  '数据版本号错误',
	'240003'    =>  '只能删除已启用的版本',
	'240004'    =>  '该版本数据无法启用',
	'240005'    =>  '该版本无法对数据进行操作',
    '240091'    =>  '文件不存在',
    '240092'    =>  '该版本文件不能启用',
    '240101'    =>  '上传文件类型不允许',
    '240201'    =>  'CSS文件已存在',
    '240301'    =>  'JS文件已存在',




	//营销
	//兑换券
	'250001'    =>  '每批生成兑换券数量不能超过10000',

	//红包
	'250101'    =>  '每批生成红包数量不能超过10000',
	'250102'	=>  '系统异常',
	'250103'	=>  '你来晚了，红包被抢光了！',
	'250104'	=>  '系统异常',
	'250105'	=>  '您已经抢了太多红包了~',
	'250106'	=>  '先买点东西再来抢吧~',

	//抽奖
	'250201'	=>  '您来晚了，活动已经结束了！',
	'250202'	=>  '机会用完了，没法再抽了！',
	'250203'	=>  '',
	'250204'	=>  '',
	'250205'	=>  '',
	'250206'	=>  '',


	'800001'	=>  '没有找到该组件',
	'800002'	=>  '您没有该权限',


//以9开头的信息为框架提示信息，非必要情况请勿修改
	'900001'	=>	'未知系统异常',
	'900002'	=>	'提示信息未配置',
	'900003'	=>	'文件载入失败',
	'900004'	=>	'提示信息未定义',

	//smarty error
	'901001'	=>	'Smarty 未知异常',

	//tools error
	'902001'	=>	'工具类实例化失败',
    '902002'    =>  '不允许上传该类型的文件',
    '902003'    =>  '不支持写文件',
    '902101'    =>  '缩略图生成失败',

	//vo error
	'903001'	=>	'Vo对象名称不能为空',
	'903002'	=>	'该记录不存在',
	'903003'	=>	'值对象ID为空，无法获取关联数据',
	'903004'	=>	'值对象没有该字段',
	'903005'	=>	'值对象与数据库未关联，无法自动获取数据。请先为该字段赋值然后再调用',
	'903006'	=>	'没有设置值对象需要更新的字段',
	'903007'	=>	'值对象更新失败',
	'903008'	=>	'值对象删除失败',

	//dao error
	'904001'	=>	'Dao对象名称不能为空',
	'904002'	=>	'搞操作没有指定主从库',
	'904003'	=>	'没有找到指定的数据库配置信息',
	'904004'	=>	'该host未配置资源池',
	'904005'	=>	'资源池中没有找到相应配置信息',
	'904006'	=>	'你调用了一个Dao中未定义的方法',
	'904007'	=>	'请指定主从库',
	'904008'	=>	'数据库未配置',

	//dao_range
	'904101'	=>	'range分库分表模型必须为每个操作指定操作表',
	'904102'	=>	'range分库分表模型必须为每个操作指定操作库',
	'904103'	=>	'你必须为该操作指定IDS',
	'904104'	=>	'该值对象不能通过自动发号器发号，你必须为其指定数据的ID。',
	'904105'	=>	'散列参考值不能为空',
	'904106'	=>	'',
	'904107'	=>	'',

	//dao_user_follow
	'904901'	=>	'user_id不能为空',

	//dao_food_base
	'904902'	=>	'store_id不能为空',
	'904903'	=>	'city_id不能为空',

	//db error
	'905001'	=>	'数据库连接失败',
	'905002'	=>	'数据库操作失败',
	'905003'	=>	'数据库执行错误',


	//config error
	'906001'	=>	'未找到指定配置信息',

	//controller
	'907001'	=>	'控制器未找到指定模型',

	//邮件
	'908001'	=>	'请设置邮件类型',
	'908002'	=>	'该邮件类型未配置',
	'908003'	=>	'邮件模板文件不存在',

	//短信
	'908101'    =>  '短信发送失败！',
	//交易
	'909001'    =>  '非法来源',
	'909002'    =>  '这个订单已经支付完成，不能进行此操作！',

);
return $msg;
?>
